TestPlans/Home/Legal & General Essentials/xml/LGE3_08122014_20.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ssp="http://SSP.Authentication.Services/" xmlns:tem="http://WebServices.ssp-uk.com/HouseholdAggregator/">
  <soap:Header>
    <ssp:Security>
      <ssp:SystemUsername>1045678055</ssp:SystemUsername>
      <ssp:SystemPassword>AE9ACEEC-D1CA-4BF9-8318-66C61EF5B74F</ssp:SystemPassword>
      <ssp:SystemID>2</ssp:SystemID>
    </ssp:Security>
  </soap:Header>
  <soap:Body>
    <tem:GetQuote>
      <tem:quote CoverStart="2014-12-08" CoverStartTime="00:00:00" IsMultiProposer="false" CoverType="ContentsAndBuildings" PaymentFrequency="U" PaymentFrequencyDescription="Unknown">
        <SingleQuoteRequest QuoteMultipleBroker="true" BrokerSCIDs="C00057-001,C00057-002" />
        <Proposer ProposerType="MainProposer" RelationshipToProposer="P" DateOfBirth="1979-04-17" Sex="Female" MaritalStatus="Married" IsSmoker="false" FirstTimeBuyer="false" HasConvictions="false" HasCcj="false" HasPolicyRefused="false" DateResidencyStarted="2014-12-08" EmailAddress="michael.hudson@emailreaction.org" Title="Miss" FirstName="Tabitha" LastName="Twenty-Zero" DayTimePhone="01778852852">
          <Occupation IsFullTime="true" EmploymentStatus="HouseholdDuties" OccupationCode="H09" BusinessCode="186" />
          <CorrespondenceAddress HouseName="Flat 1-6 Gladstone Court" AddressLine1="130 Upper Parliament Street" AddressLine2="Liverpool" AddressLine3="" AddressLine4="Lancashire" Postcode="L8 7JY" />
        </Proposer>
        <Claim Cost="1000" IsCurrentAddress="false" Date="2013-01-01" ClaimType="06" CoverType="Buildings" />
        <Premises YearBuilt="1997" PremisesType="32" NumberOfBedrooms="1" NumberOfBathrooms="1" TotalNumberOfRooms="4" IsOccupiedNight="true" OccupancyStatus="HolidayHome" OwnerShipType="14" IsSoleOccupancy="true" ListedBuildingType="3" IsUsedForBusiness="true" IsClericalWorkOnly="false" SelfContainedAndLockable="true" MaxDaysUnoccupied="30" HasSmokeDetector="true" SecurityDeviceDiscountRequired="false" IsFurnished="true" OccupantsOver18="0" OccupantsUnder18="0" HasExteriorLighting="false" IsSecurityActivated="false" ConstructionWall="02b" ConstructionRoof="16" RoofFlatPercentage="50" IsFreeFromFlooding="true" IsNearRiverBank="false" IsGoodStateOfRepair="true" IsSOMaintained="false" IsTreesVicinity="false" HasExtension="false" IsOccupiedDay="true" HasStandardAlarm="true" AlarmProfMaintained="true" HasApprovedAlarm="true" MemberOfNeighbourHoodWatch="true" HasSafeInstalled="true" HasApprovedLocks="true" MainDoorLockType="908" HasPatioDoors="false" HasOtherDoors="true" OtherDoorLockType="908" AccessibleWindowLocks="KeyOperatedLocks" IsFreeFromSubsidence="true" IsFreeFromUnderpinning="true">
          <Address HouseName="Flat 1-6 Gladstone Court" AddressLine1="130 Upper Parliament Street" AddressLine2="Liverpool" AddressLine3="" AddressLine4="Lancashire" Postcode="L8 7JY" />
        </Premises>
        <CoverRequired>
          <Buildings RebuildingCost="100000" IsAccidentalDamageRequired="false" VoluntaryExcess="100" IsFullValue="true" />
          <Contents ValuablesSumInsured="4000" ContentsCoverType="NewForOld" IsAccidentalDamageRequired="false" VoluntaryExcess="100" IsFullReplacementValue="true" ValueMostExpensiveItem="4000" AllRisksRequired="false" PersonalEffectsSumInsured="0" TotalSumInsured="40000">
            <SpecifiedItems>
              <SpecifiedItem ItemType="F02" Description="Fur coat" Value="3200" />
            </SpecifiedItems>
          </Contents>
        </CoverRequired>
      </tem:quote>
      <tem:sourceOfBusiness>CompareTheMarket</tem:sourceOfBusiness>
    </tem:GetQuote>
  </soap:Body>
</soap:Envelope>